{"posts":{"20":{"id":0,"title":"Oblivium sempiternum daemonis.","date":"2012-04-22T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[1],"tags":[39,40],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n<!-- PHOTO 2 -->\n<!-- PHOTO 3 -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n<!-- PHOTO 6 -->\n<!-- PHOTO 7 -->\n<!-- PHOTO 8 -->\n\n<blockquote>\n<p>Oblivium sempiternum daemonis.</p>\n</blockquote>\n<p>Extraites toutes fraiches du jeu de ce matin. Sentez-vous donc l’odeur de la pierre froide, celle de la terre humide, et enfin celle du sang ? </p>\n<p>Voyez-vous briller le reflet des flammes des bougies dans les vitraux à moitié brisés ? </p>\n<p>Jeu terminé ce matin, commencé il y a longtemps. J’ai pu prendre le temps d’admirer les graphismes, les cinématiques… Tout y est réussi ! </p>\n<p>Castlevania fut toute mon enfance, c’était un plaisir de rejouer à un jeu de légende tel que celui-là, surtout en 3D.</p>\n<p>Mes respects à Oscar Araujo, ainsi que sa brillante équipe pour ce volet joliment réussi.</p>\n<p>Je suis donc dans l’expectative d’un volet suivant, en espérant qu’il soit meilleur que le premier, si c’est possible.</p>\n<p><em>(Gabriel, stop being sexy.)</em></p>\n","excerpt":0,"source":"_posts/castlevaniatest.md","slug":"castlevaniatest","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"21":{"id":0,"title":"The cake is a huuuuuge lie.","date":"2012-04-24T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[1],"tags":[1,2,3],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n<!-- PHOTO 2 -->\n<!-- PHOTO 3 -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n\n<p>Still alive. Still alive.</p>\n<p>Fini le jeu. Je ne sais pas exactement combien d’heures j’y ai passé exactement, à regarder tout dans le moindre détail, étudier chaque écriture, chaque mur, chaque partie…</p>\n<p>19 niveaux très bons. Je suis formelle. GLaDOS est une véritable horreur, mais reste un personnage très charismatique. Bref, pas besoin d’en dire plus, j’ai adoré. </p>\n<p>Je crois que les moments intenses ont été vers la fin, lors du passage à travers les multiples checkpoints, lorsque je ne savais à quoi m’attendre, lorsque les tourelles m’ont bien poussé à bout, lorsque les vapeurs d’acide me prenaient la gorge… Tout cela vers quelques heures avancées de la nuit, seule dans le noir.</p>\n<p>Bleh, j’ai même pleuré à la fin. Je connaissais la chanson par coeur, également. o/</p>\n<p><em>Addendum: suis en possession du deuxième volet, ça va envoyer. :3</em></p>\n","excerpt":0,"source":"_posts/endingportal.md","slug":"endingportal","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"22":{"id":0,"title":"Un petit avant-goût de Portal 2","date":"2012-04-29T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[1],"tags":[1,4,3],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n<!-- PHOTO 2 -->\n<!-- PHOTO 3 -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n\n<p>Bonjour. Ou plutôt bonsoir.</p>\n<p>Je profite du calme de la nuit pour publier quelques screens de mon avancée dans le célèbre jeu Portal 2.</p>\n<p>Je ne vous dis pas tout, tout de suite, car mon avis sur le jeu viendra quand j’aurais fini celui-ci. </p>\n<p>Les screens de cette nuit porteront sur les endroits creepy (cachés ou pas, d’ailleurs) par lesquels j’ai pu passer sur la première partie du jeu (Modern Aperture).</p>\n<p>Bien à vous,</p>\n<p>Votre chère StormLexie.</p>\n<p>(PS : Je suis bien plus avancée dans le jeu, mais chuuut, le reste viendra après ! :D)</p>\n","excerpt":0,"source":"_posts/avantgoutportal2.md","slug":"avantgoutportal2","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"23":{"id":0,"title":"Testing Portal 2. For Science.","date":"2012-05-08T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[1],"tags":[1,4,3],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n<!-- PHOTO 2 -->\n<!-- PHOTO 3 -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n<!-- PHOTO 6 -->\n\n<p>Bonjour/soir à tous.</p>\n<p>Voici, finalement, avec un peu de retard, mon article sur Portal 2. Je l’ai terminé samedi dernier au soir, mais je voulais prendre le temps d’analyser l’histoire un peu plus et traiter les quelques screenshots que j’ai pris pour ce blog. </p>\n<p>Comme on pouvait s’y attendre, je suis une fois de plus bluffée par le magnifique travail de Valve sur ce second volet. Un triomphe. </p>\n<p>L’ambiance du jeu y est moins angoissante, quelques petites touches humoristiques sont ajoutées, et on y fait la connaissance d’autres personnages.</p>\n<p>Egalement, on en apprend un peu plus sur l’histoire troublante et triste de Chell, le personnage principal, et d’autres tels que GLaDOS ou Cave Johnson, qui, soit dit en passant est probablement l’un des personnages les plus charismatiques.</p>\n<p>L’aventure se déroule en plusieurs parties, en dévoilant l’historique complète des labos d’Aperture. Quelques petites salles y sont cachées, on y voit certaines références, bref, c’est très complet. </p>\n<p>En somme, un jeu qui m’a fait passer du rire aux larmes, de la colère (parce que je n’arrivais à résoudre certaines des énigmes un peu trop ardues pour mon petit cerveau…) à l’émerveillement, et je crois que le mieux a été à la fin, je n’ai jamais été aussi ébahie par la fin d’un jeu.</p>\n<p>En pièce jointe à ce billet quelques photos de mon aventure au sein d’Aperture, à apprécier avec la musique ci-dessous.</p>\n<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F66065262\"></iframe>\n\n<p>Merci de votre lecture. (; <strong>For Science.</strong></p>\n<p><em>NB: Je sais que ce jeu est sorti depuis un petit moment maintenant, mais je jouais peu sur PC avant, et je n’osais pas vraiment me lancer dedans. Comme d&#39;habitude, je dois beaucoup à un ami Twitto, sans qui j’aurais vraiment raté quelque chose.</em></p>\n<p>Prochainement, mon avis sur le nouveau DLC qui vient de sortir ! :]</p>\n","excerpt":0,"source":"_posts/portal2testing.md","slug":"portal2testing","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"24":{"id":0,"title":"New Workshop option for Portal 2!","date":"2012-05-16T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[1],"tags":[1,4,5],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n<!-- PHOTO 2 -->\n<!-- PHOTO 3 -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n<!-- PHOTO 6 -->\n\n<p>Bonsoir à tous,</p>\n<p>Juste un petit billet en passant pour vous montrer la réussite qu’a été le nouveau DLC de Portal 2, sorti il y plus d’une semaine, rendant compatible le Steam Workshop et permettant à chacun de créer ses propres maps, et ainsi réaliser son rêve de prendre les commandes à la place de GLaDOS.</p>\n<p>Pour voir mon [<strong>TEST</strong>] complet sur le site d’un ami, c’est par &gt;<a href=\"http://lecafedugeek.fr/test-editeur-de-niveau-pour-portal-2/\">ici</a>&lt;</p>\n<p>Pour ce qui est de l’<strong>éditeur</strong> : user-friendly, très facile à prendre en main, il permet de réaliser en quelques minutes des salles faciles, avec une interface simple et mignonne. Un mode permet de passer directement en vue contextuelle, permettant ainsi de passer dans la minute dans la réalité de sa salle de test.</p>\n<p>Ces maps, comme dit précédemment sont compatibles <strong>Workshop</strong>, et nous avons, grâce à la fameuse communauté de joueurs, accès à des maps de créateurs plus chevronnés. En effet, les créations sortant de Hammer (moteur graphique Source, toussa…) peuvent être mises en ligne, nous offrant ainsi des tests à couper le souffle, contenant des éléments du mode solo qui nous ont marqué.</p>\n<p>Pour ma part, je me contente de tester des salles telles que les “<em>Angry Tests</em>&quot;, la fameuse “<em>Decay</em>&quot;, ou encore la superbe “<em>Not another Puzzle</em>&quot;. Cherchez un peu dans Steam, vous trouverez. Il est entendu que si je réalise des maps, elles seront postées ici.</p>\n<p>Bref, on va pas épiloguer, j’ai encore du boulot pour la soirée et ce DLC possède déjà pas mal d’articles parlant de lui ! </p>\n<p>For Science, you monsters. ♥</p>\n","excerpt":0,"source":"_posts/workshopoptionportal2.md","slug":"workshopoptionportal2","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"25":{"id":0,"title":"Castle trip","date":"2012-05-20T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[2],"tags":[6,7],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n<!-- PHOTO 2 -->\n<!-- PHOTO 3 -->\n<!-- PHOTO 4 -->\n\n<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F5451452\"></iframe>\n\n<p>Bonsoir.</p>\n<p>Pour changer un peu…</p>\n<p>Une petite chanson simple, tranquille, pour accompagner le visionnage de ces 4 photos simples, retouchées légèrement dans mon ambiance habituelle, selon mon humeur. Il faisait très humide, aujourd’hui. C’est tout ce que je puis partager pour l’instant, pas d’inspiration ce soir, l’esprit trop occupé par Docteur Who, probablement.</p>\n<p>Enjoy.</p>\n","excerpt":0,"source":"_posts/castletrip.md","slug":"castletrip","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"26":{"id":0,"title":"School trip","date":"2012-07-11T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[2],"tags":[6,8],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n<!-- PHOTO 2 -->\n<!-- PHOTO 3 -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n<!-- PHOTO 6 -->\n\n<p>Bonsoir, </p>\n<p>Quelques photos pour John, mais aussi pour vous. Je suis déçue de mes prises ; je n’ai pas obtenu ce que je voulais. Je vous ramène tout de même ces quelques clichés, en espérant qu’ils seront plaisants à regarder.</p>\n<p>Pour la petite info, tout ceci se trouve dans la commune de <a href=\"http://fr.wikipedia.org/wiki/Saint-Jean-Cap-Ferrat\">St Jean Cap Ferrat</a> (cuz my name’s wikipedia) ; une villa, très connue, s’y trouve, avec de très beaux jardins.</p>\n<p>Enjoy. :]</p>\n","excerpt":0,"source":"_posts/schooltrip.md","slug":"schooltrip","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"27":{"id":0,"title":"Building my paperfriends.","date":"2012-07-26T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[1],"tags":[9,2,10],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n<!-- PHOTO 2 -->\n<!-- PHOTO 3 -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n<!-- PHOTO 6 -->\n\n<p>Deux trois photos de mes récents papercrafts, temps perdu à plier, coller, découper, imprimer des feuilles de papier pour former mes rêves et mes bestioles préférées.</p>\n","excerpt":0,"source":"_posts/papercraft.md","slug":"papercraft","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"28":{"id":0,"title":"On the Lost Coast","date":"2012-08-12T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[1],"tags":[11,12,13,1],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n<!-- PHOTO 2 -->\n<!-- PHOTO 3 -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n\n<p>Half Life - Lost Coast.</p>\n<p>Parce que j’avais promis une série de shots sympas.</p>\n<p>Et puis parce que j’aime bien ce petit ajout de Valve à Half Life. Il s’agit d’une minuscule démo jouable présentant une petite “nouveauté&quot; technologique pour l’époque (2005 semble si proche !), le HDR Rendering, apportant une meilleure qualité visuelle et un bon rendu de lumières.</p>\n<p>[Pour le coin, il s’agit de Saint Olga, Europe de l’Est (Union Soviétique, toussa) où notre cher Gordon évolue pour le sauver.]</p>\n","excerpt":0,"source":"_posts/lostcoast.md","slug":"lostcoast","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"29":{"id":0,"title":"Sur les hauteurs de la ville.","date":"2012-08-28T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[2],"tags":[14,15],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n<!-- PHOTO 2 -->\n<!-- PHOTO 3 -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n<!-- PHOTO 6 -->\n<!-- PHOTO 7 -->\n\n<p>Quelques clichés de “La Maison du Fada&quot; (aka La Cité Radieuse).</p>\n<p>Par le brillant architecte Le Corbusier, entre 45 et 52.</p>\n<p>…</p>\n<p><a href=\"http://fr.wikipedia.org/wiki/Cit%C3%A9_radieuse_de_Marseille\">(M04R.)</a></p>\n<p>You should also listen to this.</p>\n<iframe frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"http://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F309005&amp;auto_play=false&amp;show_artwork=true&amp;color=0f3e20\" width=\"100%\"></iframe>","excerpt":0,"source":"_posts/houseofthemadman.md","slug":"houseofthemadman","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"30":{"id":0,"title":"Going out, to the MAC","date":"2012-09-15T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[2],"tags":[16,17],"comments":true,"layout":"post","content":"<!-- PHOTO ONE -->\n<!-- PHOTO TWO -->\n<!-- PHOTO THREE -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n<!-- PHOTO 6 -->\n<!-- PHOTO 7 -->\n<!-- PHOTO 8 -->\n\n<p>Bonjour,</p>\n<p>Un post peu habituel pour aujourd’hui…</p>\n<p>Petite sortie au [mac] pour le lycée cette après-midi, dans le cadre des Journées du Patrimoine.</p>\n<p>Quelques oeuvres d’art contemporain sortant de l’ordinaire, assez étranges, certaines drôles. Sortie intéressante toutefois.</p>\n<p>Photos disponibles aussi sur mon 500px.</p>\n<p>Aaaand, you should listen to this.</p>\n<iframe frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"http://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F309007&amp;auto_play=false&amp;show_artwork=true&amp;color=004d36\" width=\"100%\"></iframe>","excerpt":0,"source":"_posts/mactime.md","slug":"mactime","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"31":{"id":0,"title":"On the Edge of the Mirror.","date":"2012-10-24T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[1],"tags":[18,19,20,21],"comments":true,"layout":"post","content":"<!-- PHOTO ONE -->\n<!-- PHOTO TWO -->\n<!-- PHOTO THREE -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n<!-- PHOTO 6 -->\n<!-- PHOTO 7 -->\n<!-- PHOTO 8 -->\n<!-- PHOTO 9 -->\n<!-- PHOTO 10 -->\n\n<p>Bonsoir bonsoir,</p>\n<p>J’ai retrouvé, il y a peu, des screens stockés dans une boite à des milliers de kilomètres de là. J’espère qu’ils vous plairont.</p>\n<p>Dans le cas ou les graphismes ne vous seraient pas familiers, il s’agit de Mirror’s Edge. Sorti en 2008 sur consoles, 2009 sur notre plateforme favorite. Dév’ par DICE, édité par EA. Tout simple à première vue. Fondé sur le moteur UnrealEngine 3, la vue à la première personne est assez souple, quand on s’y est fait. </p>\n<p>Se sert du principe de l’art du déplacement en milieu urbain, de manière rapide, avec des mouvements particuliers. Faith, notre héroïne, messagère, vole de building en building pour déjouer des complots et problèmes au sein d’une ville futuriste.</p>\n<p>Assez dur à prendre en main. Certains passages compliqués où il faut savoir s’accrocher. Mais très bon jeu malgré tout, un must-have, auquel il faut avoir joué.</p>\n<p>C’est ici que ce court article s’achève. En espérant vous retrouver d’autres petites choses pour la prochaine.</p>\n<p>Votre Lexie.</p>\n","excerpt":0,"source":"_posts/myfaithisrunningaway.md","slug":"myfaithisrunningaway","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"32":{"id":0,"title":"... Trying to stop an Echo, by Hammock","date":"2012-12-22T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[3],"tags":[22,23],"comments":true,"layout":"post","content":"<p><!-- PHOTO 1 --></p>\n<p><iframe frameborder=\"0\" height=\"166\" src=\"http://www.youtube.com/embed/videoseries?list=PLzg5XiQQjUgfofQUgNqaNuDE-_sQjwekx\" width=\"100%\"></iframe></p>\n\n<p>Bonsoir.</p>\n<p>Comme prévu, cet article est un peu spécial.</p>\n<p>J’ai découvert sur <a href=\"http://www.di.fm/\">di.fm</a> il y a peu un album qui m’a profondément chamboulée. J’écoutais paisiblement le chan <a href=\"http://www.di.fm/spacemusic\">Space Dreams</a> quand je suis tombée sur la merveille “Will you ever love yourself?&quot;. Je me suis empressée d’aller découvrir l’artiste, <strong>Hammock</strong>, et suis donc tombée sur cet album de 18 titres. Un peu inhabituel, mais pour le style, ça me paraissait normal.</p>\n<p><strong>Hammock</strong> est visiblement un duo d’anciens musiciens du groupe Common Children, rassemblés pour faire leur propre mixture. Originaire de Nashville, le duo fut fondé en 2004 et ont déjà un bon nombre d’albums/d’EPs à leur actif.</p>\n<p>Il s’agit donc d’<strong>ambient post-rock</strong>, assez doux à l’écoute, quelques notes sympas ouvertes à l’improvisation. Le style est varié, évoluant de quelques notes en écho, arpèges doux à l’oreille, vocals calmes. Certaines font penser à des balades, incitant à la paix intérieure, tandis que d’autres sont plus rythmées.</p>\n<p>Globalement, toutes sont magnifiques à mes oreilles, mais <em>Disappear like the Morning</em>, <em>Like Starlight into Day</em>, <em>The House Where we Grew up</em> battent un record d’awesomeness. Un mélange instrumental parfait, un ajout des voix qui colle bien, et une atmosphère réellement prenante.</p>\n<p>Cet album mérite vraiment que l’on s’arrête dessus, si l’on est amateur du genre. Anyway, s’arrêter sur les chans Ambient ou Space Dreams fait toujours du bien en cas de stress, et permet parfois de rencontrer de très bons sons.</p>\n<p>Ce fut relativement court pour une première review, mais c’était pour un petit essai. En espérant que ça vous plaise, et de toutes façons il était de mon devoir de partager cet album. Voilà voilà.</p>\n<p>Bien à vous, </p>\n<p>Votre Lexie.</p>\n<p><em>PS : Pssst, la photo vient de <a href=\"http://desktopography.net/exhibition/2012/aura\">&gt;là&lt;</a>, ce site est awesome au passage.</em></p>\n","excerpt":0,"source":"_posts/hammockalbumreview.md","slug":"hammockalbumreview","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"33":{"id":0,"title":"MineCon 2012, my Review.","date":"2012-12-22T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[1,4],"tags":[10,24,25,26],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n\n<p>Bonsoir,</p>\n<p>Je me décide enfin à publier ce billet qui attendait patiemment sur mon Tumblr. Vous vous doutez sûrement déjà de son sujet.</p>\n<p><strong>#Minecon2012</strong>, bien évidemment.</p>\n<p>Une convention awesome, avec des events supers, beaucoup de monde, un lieu parfaitement choisi, un contexte génial. Une bouffée d’oxygène entre deux semaines.</p>\n<p>J’ai eu l’occasion de me rendre compte réellement de la communauté qui s’était développée grâce à Minecraft, un jeu partant de rien pour finir en un tout. Une ascension fulgurante, merveilleuse, indescriptible. </p>\n<p>J’ai aussi pu y rencontrer les gens des Internet que je fréquente depuis quelques mois, et c’est ce qui l’a rendue si magique. Un groupe génial, composé de Twittos de toutes sortes, de tous âges, de pleins de coins de la France. Un groupe avec qui j’ai passé des moments extraordinaires, me sentant enfin dans mon élément, avec les gens que j’aimais vraiment. Des gens avec de super mentalités, des valeurs rapprochées des miennes, des passions communes. Les premiers regards échangés étaient un peu timides, mais cela ne dura pas. Des étincelles de joie et de malice brillaient dans les yeux de chacun de nous alors que nous parcourions les espaces de la convention. Nous avons eu la chance d’assister à quelques conférences, de discuter avec des gens, d’échanger, de passer énormément de bon temps, que ce soit ensemble ou séparés. </p>\n<p>En somme, ces souvenirs resteront en moi, je ne pourrai les oublier tant ce week-end fut intense. Intense en amusement, en amitié, en joie. Je me mets à espérer une rencontre prochaine, qui soit aussi géniale que le fut celle-ci, voire plus encore, si c’est réellement possible.</p>\n<p>Thank you guys. </p>\n<blockquote>\n<p>The first meeting, but not the last.</p>\n</blockquote>\n<p><iframe frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"http://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F38269627&amp;auto_play=false&amp;show_artwork=false&amp;color=4c4845\" width=\"100%\"></iframe></p>","excerpt":0,"source":"_posts/mineconreview.md","slug":"mineconreview","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"34":{"id":0,"title":"Chaos on the Land, with the Walking Dead...","date":"2013-02-03T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[1],"tags":[27,28,13],"comments":true,"layout":"post","content":"<!-- PHOTO 1 -->\n<!-- PHOTO 2 -->\n<!-- PHOTO 3 -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n<!-- PHOTO 6 -->\n<!-- PHOTO 7 -->\n<!-- PHOTO 8 -->\n\n<p>Bonjour à vous,</p>\n<p>Il y a longtemps que je n’avais plus publié. Veuillez m’en excuser.</p>\n<p>J’ai choisi aujourd’hui The Walking Dead, que j’ai fini il y a peu. Il m’a été offert par un ami et je me devais d’écrire sur ce jeu. Pourquoi ? Raison simple. Un jeu plein d’espoir, mais aussi de désespoir. Riche en rebondissements. Il a joué avec mes sentiments et mes impressions comme le ferait un chaton avec une pelote de laine. A fait couler mes larmes plus d’une fois.</p>\n<p>Bien que le système de jeu ne soit pas des plus innovants et imaginatif, les développeurs de celui-ci se sont surpassés sur le scénario.</p>\n<p>Présenté en 5 épisodes, comportant chacun son lot de rebondissements, tel une série, il fut édité en 2012 par les studios TellTale Games. Inspiré de la série de <em>comics</em> du même nom, il se concentre surtout sur l’évolution émotionnelle des personnages, se construisant sur chacun des faits, gestes et attitudes du personnage au centre de l’action, Lee. Le jeu évolue au gré de ces changements, délivrant une expérience des plus intéressantes. Le scénario a été travaillé finement, alternant séquences de peur et séquences tristes. Le gameplay fluctue en fonction du scénario, de la même manière, mélangeant <em>quick-time events</em> et déplacements libres, ou choix d’actions.</p>\n<p>Même si le jeu n’a pas été <em>très</em> travaillé en lui-même sur le plan des graphismes, il reste très agréable comme en attestent les quelques screens ci-dessus.</p>\n<p>Je vous conseille vivement de vous caler confortablement avec un casque, une manette, et de tester les quelques épisodes disponibles. Ils en valent vraiment la peine.</p>\n<p>Bien à vous,</p>\n<p><strong><em>Votre StormLexie.</em></strong></p>\n","excerpt":0,"source":"_posts/testthewalkingdead.md","slug":"testthewalkingdead","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"35":{"id":0,"title":"200 years ago, on an icy planet...","date":"2013-04-06T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[1],"tags":[29,30,31,32],"comments":true,"layout":"post","content":"<!-- PHOTO ONE -->\n<!-- PHOTO TWO -->\n<!-- PHOTO THREE -->\n<!-- PHOTO 4 -->\n<!-- PHOTO 5 -->\n<!-- PHOTO 6 -->\n<!-- PHOTO 7 -->\n<!-- PHOTO 8 -->\n<!-- PHOTO 9 -->\n<!-- PHOTO 10 -->\n\n<p>Bonsoir bonsoir,</p>\n<p>Un petit set de screens provenant du dernier chef-d&#39;oeuvre Dead Space 3.</p>\n<p>Pas du tout mon genre de jeu, d&#39;habitude, mais je dois avouer que l&#39;ensemble de la série m&#39;a bluffé par son scénario, et je me devais de poster un petit article là dessus.</p>\n<p>Quelques <strong>infos générales</strong> : Dead Space 3 est la suite des deux volets précédents de la série, sorti en février 2013, développé par Visceral Games (et malheureusement édité par EA). Il tourne sous le Visceral Engine, en vue objective (ce qui est étonnant comme choix pour un Survival Horror) et les graphismes sont nettement améliorés par rapport au précédent, en mettant plein les yeux au joueur dans n&#39;importe quelle phase de jeu.</p>\n<p>La <strong>nouveauté</strong> ici est la <strong>Co-Op</strong> : Le protagoniste, <strong>Isaac Clarke</strong>, se fait accompagner d&#39;un certain <strong>John Carver</strong> qui sait toutefois se faire très discret en mode solo. </p>\n<p>Selon les fans de la première heure, le jeu est surtout orienté Action, bien plus que les précédents qui étaient centrés sur la peur et l&#39;horreur (ce qui a très bien marché sur moi, je dois l&#39;avouer).</p>\n<p>L&#39;<strong><em>histoire</em></strong> est très complexe, il est préférable d&#39;avoir joué aux deux précédents pour tout comprendre. J&#39;ai moi-même du mal à en capter toutes les subtilités. Toutefois, il est évident que c&#39;est l&#39;un des scénarios les plus travaillés que je connaisse. Les rebondissements y sont nombreux et la construction générale plaisante. Les sentiments sont présents à de nombreuses phases du jeu et on peut voir que les expressions faciales ont été travaillées. J&#39;ai l&#39;impression que les jeux comme ça se font de plus en plus rares, de nos jours.</p>\n<p><strong><em>EA, parlons-en</em></strong>. Alors que je découvrais toute juste la série, ces gens-là ont annoncé que le jeu ne disponible en ligne que sur Origin. Cette info a eu du mal à passer pour ma part, ayant une préférence pour Steam. Puis, je me suis rendue compte que ces mêmes gars avaient ajouté quelques petites options pour pouvoir acheter du contenu téléchargeable tout au long du jeu. Dans ce volet de Dead Space, les armes sont à fabriquer par soi-même, les modifications sont libres, et on peut faire ses propres objets consommables (kits de soin, recharge stase, dynabarres, etc.). Il est donc important de partir à la recherche de matières premières si l&#39;on ne veut pas manquer de ressources. Et là, EA propose à ses clients (parce que c&#39;est l&#39;appellation, maintenant...) d&#39;acheter directement ces matières premières. Comme ça, pof. Tombées dans l&#39;assiette. Servies sur un plateau d&#39;argent. Et moi, je trouve ça inadmissible. Satisfaire le client pour lui permettre une expérience de jeu plus facile et sans trop d&#39;efforts.</p>\n<p><strong><em>Oh le beau joueur assisté.</em></strong></p>\n<p>Malgré cela, le jeu mérite que l&#39;on dépense son argent. Pas pour EA, mais au moins pour les petites pattounes de chez Visceral qui se sont saignées pour nous apporter ce jeu à temps. C&#39;est la moindre des choses, que de remercier un développeur pour son travail. Du respect, tout simplement, une valeur qui a tendance à être oubliée, ces temps-ci.</p>\n<p><em>200 years ago, on a Icy Planet named Tau Volantis...</em></p>\n<iframe frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F79091580&amp;color=2c2a29&amp;auto_play=false&amp;show_artwork=false\" width=\"100%\"></iframe>\n\n<p>(Certains de ces screens m&#39;ont été gracieusement délivrés par <a href=\"http://www.apcros.fr/\">Apcros</a>, mentor et modèle qui m&#39;a fait découvrir ce jeu, et sans qui je n&#39;aurais pu apprécier un tel chef-d&#39;oeuvre. Merci à lui! ♥)</p>\n","excerpt":0,"source":"_posts/deadspace3takedownthehorror.md","slug":"deadspace3takedownthehorror","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"36":{"id":0,"title":"A Sweet Music Recommandation, w/ Helios","date":"2013-05-05T00:00:00.000Z","updated":"2013-07-31T13:59:11.000Z","categories":[3],"tags":[33,34,23,35],"comments":true,"layout":"post","content":"<!-- PHOTO ONE -->\n<!-- PHOTO TWO -->\n<!-- PHOTO THREE -->\n\n<p>Hello there !</p>\n<p>Wanted to share you two new sets I just created on SoundCloud.</p>\n<p>The sets focus on <strong>Keith Kenniff</strong> -Helios- music, a great artist. A blend of electronic/ambient/indierock/coolish stuff.</p>\n<p>Perfect for work in the sunlight, naps on sweet beds or waits in a long corridor. The first one is about happiness, the second one more about calm.</p>\n<p>Hope you like it,</p>\n<p>Lexie.</p>\n<p><em>Addendum: I will update it sometimes, if I find something new which corresponds to the spirit of the set</em></p>\n<iframe frameborder=\"no\" height=\"300px\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F5401971&amp;color=544f4b&amp;auto_play=false&amp;show_artwork=true\" width=\"100%\"></iframe> <br />\n\n<iframe frameborder=\"no\" height=\"300px\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F5401700&amp;color=544f4b&amp;auto_play=false&amp;show_artwork=true\" width=\"100%\"></iframe>","excerpt":0,"source":"_posts/heliosrecommandation.md","slug":"heliosrecommandation","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-31T13:59:11.000Z"},"37":{"id":0,"title":"SudWeb 2013, cet event énorme.","date":"2013-05-19T00:00:00.000Z","updated":"2013-07-28T17:22:35.000Z","categories":[5,6],"tags":[36,37,38,35],"comments":true,"layout":"post","content":"<!-- PHOTO ONE -->\n<!-- PHOTO TWO -->\n\n<p><strong><a href=\"http://sudweb.fr/2013/\">SudWeb 2013</a></strong>, cet <em>event</em> énorme.</p>\n<p>SudWeb, c&#39;est un <em>event</em> pour le web, par le web, et avec plein de gens dedans. Une super équipe, de super opportunités, et des gens rassemblés par une seule passion.</p>\n<p>Accompagnée du Monsieur <a href=\"http://lbsrf.fr/\">@Eramdam</a>, j&#39;ai pu m&#39;y rendre le samedi 18, jour de l&#39;<strong>Elaboratoire</strong> (qui d&#39;ailleurs avait lieu dans un superbe bâtiment).</p>\n<p>Nous avons donc pu assister à tout un tas d&#39;ateliers vraiment sympathiques, 4 très exactement. En voici une petite review.</p>\n<p><strong>Je ne sais pas dessiner une interface mobile</strong> : consistait à imaginer et dessiner (en petits groupes) une interface mobile selon des thèmes donnés, pour ma part l&#39;un de mes préférés. Je me suis rendue compte qu&#39;un (bon?) concept pouvait naître en très peu de temps. Cet atelier a éveillé en moi une envie forte de Design d&#39;UIs !</p>\n<p><strong>Designons notre code</strong> : Atelier consistant à reprendre un morceau de code <strong>bien propre</strong> en JS (ici <a href=\"http://tzi.github.io/CRADE/\">http://tzi.github.io/CRADE/</a>), bien le commenter, le rendre propre pour qu&#39;il soit compréhensible puis passer son ordi à son binôme pour qu&#39;il fasse les exos suivants sur ledit code, dont la tâche serait -normalement- facilitée par la correction. Pour ma part ça a été un peu dur étant donné que j&#39;avais pas de grandes connaissances en JS, mais bonne expérience quand même ^.^</p>\n<p>Entre temps, <strong>REPAS TIME</strong>. J&#39;ai pu discuter avec plein plein de monde et ce fut un réel plaisir, je suis plutôt de nature timide et c&#39;était pour moi une grande première ! J&#39;ai pu glaner plein de conseils qui me seront sûrement précieux pour mon avenir. Après ça, tombola avec plein de lots, des photos en masse, des applaudissements et des étoiles dans les yeux.</p>\n<p>En piste ! Nous avons choisi de reprendre avec <strong>L&#39;intégration de mails responsive</strong>. Et là, surprise ! Je m&#39;aperçois que c&#39;est le Monsieur <a href=\"https://twitter.com/HTeuMeuLeu\">@Hteumeuleu</a> qui animait l&#39;atelier, personne grâce à qui j&#39;ai connu la SudWeb ! De bons outils proposés pour cet atelier. J&#39;ai pu également parler un peu plus tard avec son animateur qui s&#39;est avéré très sympathique, ce fut un plaisir de le rencontrer.</p>\n<p>Après une courte pause, dernier atelier de la journée (on commençait un peu à fatiguer, je dois l&#39;avouer), sur <strong>La conception dans le navigateur</strong>, avec <a href=\"https://twitter.com/Apollo_Net\">@Apollo_Net</a>, débat animé et super intéressant sur les rôles des graphistes et intégrateurs, leur travail coordonné, l&#39;organisation d&#39;une boite et le futur du Web. Atelier super et repo Git pour pouvoir échanger les bons outils.</p>\n<p>Goûter puis repos avec le Damien, nous avons pu nous caler dans un petit salon fort sympa, installant nos laptops, Wi-Fi et tout le confort pour continuer à discuter et à bosser un peu sur nos codes, tout en discutant avec un membre de l&#39;équipe SudWeb, qui m&#39;a fourni tout au long de l&#39;event un accueil chaleureux et enjoué.</p>\n<p>Cette journée était une véritable réussite, et c&#39;est donc le sourire aux lèvres que je suis retournée à la gare en direction de la maison, tout en étant un peu triste que ça soit (déjà ! D:) fini. </p>\n<p>Bref, merci à tous ! L&#39;année prochaine je reviens, pour sûr, et accompagnée !</p>\n<p><em>La Lexie.</em></p>\n","excerpt":0,"source":"_posts/sudweb2013.md","slug":"sudweb2013","ctime":"2013-07-31T12:23:08.000Z","mtime":"2013-07-28T17:22:35.000Z"},"_primary":38},"pages":{"_primary":1},"categories":{"1":{"name":"Video Games","slug":"Video-Games","posts":[20,21,22,23,24,27,28,31,33,34,35]},"2":{"name":"Going Out","slug":"Going-Out","posts":[25,26,29,30]},"3":{"name":"Music","slug":"Music","posts":[32,36]},"4":{"name":"Going Out","slug":"Video-Games/Going-Out","posts":[33]},"5":{"name":"Code","slug":"Code","posts":[37]},"6":{"name":"Going Out","slug":"Code/Going-Out","posts":[37]},"_primary":7},"tags":{"1":{"name":"Valve","slug":"Valve","posts":[21,22,23,24,28]},"2":{"name":"Portal","slug":"Portal","posts":[21,27]},"3":{"name":"Aperture Science","slug":"Aperture-Science","posts":[21,22,23]},"4":{"name":"Portal 2","slug":"Portal-2","posts":[22,23,24]},"5":{"name":"Workshop","slug":"Workshop","posts":[24]},"6":{"name":"Jardins","slug":"Jardins","posts":[25,26]},"7":{"name":"Château","slug":"Château","posts":[25]},"8":{"name":"Rothschild","slug":"Rothschild","posts":[26]},"9":{"name":"Zelda","slug":"Zelda","posts":[27]},"10":{"name":"Minecraft","slug":"Minecraft","posts":[27,33]},"11":{"name":"Half Life","slug":"Half-Life","posts":[28]},"12":{"name":"HDR","slug":"HDR","posts":[28]},"13":{"name":"Video Games","slug":"Video-Games","posts":[28,34]},"14":{"name":"Corbusier","slug":"Corbusier","posts":[29]},"15":{"name":"Cité Radieuse","slug":"Cité-Radieuse","posts":[29]},"16":{"name":"Modern Museum","slug":"Modern-Museum","posts":[30]},"17":{"name":"MAC","slug":"MAC","posts":[30]},"18":{"name":"Mirror's Edge","slug":"Mirrors-Edge","posts":[31]},"19":{"name":"Electronic Arts","slug":"Electronic-Arts","posts":[31]},"20":{"name":"DICE","slug":"DICE","posts":[31]},"21":{"name":"Faith","slug":"Faith","posts":[31]},"22":{"name":"Hammock","slug":"Hammock","posts":[32]},"23":{"name":"Ambient","slug":"Ambient","posts":[32,36]},"24":{"name":"MineCon2012","slug":"MineCon2012","posts":[33]},"25":{"name":"Mojang","slug":"Mojang","posts":[33]},"26":{"name":"DisneylandParis","slug":"DisneylandParis","posts":[33]},"27":{"name":"The Walking Dead","slug":"The-Walking-Dead","posts":[34]},"28":{"name":"Telltale Games","slug":"Telltale-Games","posts":[34]},"29":{"name":"Dead Space 3","slug":"Dead-Space-3","posts":[35]},"30":{"name":"Visceral Games","slug":"Visceral-Games","posts":[35]},"31":{"name":"EA","slug":"EA","posts":[35]},"32":{"name":"Isaac Clarke","slug":"Isaac-Clarke","posts":[35]},"33":{"name":"Helios","slug":"Helios","posts":[36]},"34":{"name":"Keith Kenniff","slug":"Keith-Kenniff","posts":[36]},"35":{"name":"Avignon","slug":"Avignon","posts":[36,37]},"36":{"name":"SudWeb","slug":"SudWeb","posts":[37]},"37":{"name":"HTML5","slug":"HTML5","posts":[37]},"38":{"name":"JavaScript","slug":"JavaScript","posts":[37]},"39":{"name":"Castlevania","slug":"Castlevania","posts":[20]},"40":{"name":"Konami","slug":"Konami","posts":[20]},"_primary":41},"assets":{"1":{"source":"themes/light/source/fancybox/blank.gif","mtime":"2013-07-31T12:17:21.000Z"},"2":{"source":"themes/light/source/fancybox/fancybox_loading.gif","mtime":"2013-07-31T12:17:21.000Z"},"3":{"source":"themes/light/source/fancybox/fancybox_overlay.png","mtime":"2013-07-31T12:17:21.000Z"},"4":{"source":"themes/light/source/fancybox/fancybox_sprite.png","mtime":"2013-07-31T12:17:21.000Z"},"5":{"source":"themes/light/source/fancybox/jquery.fancybox.css","mtime":"2013-07-31T12:17:21.000Z"},"6":{"source":"themes/light/source/fancybox/jquery.fancybox.pack.js","mtime":"2013-07-31T12:17:21.000Z"},"7":{"source":"themes/light/source/js/gallery.js","mtime":"2013-07-31T12:17:21.000Z"},"8":{"source":"themes/light/source/js/jquery.imagesloaded.min.js","mtime":"2013-07-31T12:17:21.000Z"},"9":{"source":"themes/light/source/js/moment.min.js","mtime":"2013-07-31T12:17:21.000Z"},"10":{"source":"themes/light/source/js/twitter.js","mtime":"2013-07-31T12:17:21.000Z"},"11":{"source":"themes/light/source/css/style.styl","mtime":"2013-07-31T12:17:21.000Z"},"12":{"source":"themes/light/source/css/font/fontawesome-webfont.eot","mtime":"2013-07-31T12:17:21.000Z"},"13":{"source":"themes/light/source/css/font/fontawesome-webfont.svg","mtime":"2013-07-31T12:17:21.000Z"},"14":{"source":"themes/light/source/css/font/fontawesome-webfont.ttf","mtime":"2013-07-31T12:17:21.000Z"},"15":{"source":"themes/light/source/css/font/fontawesome-webfont.woff","mtime":"2013-07-31T12:17:21.000Z"},"16":{"source":"themes/persona-dark/source/fancybox/blank.gif","mtime":"2013-07-31T13:53:15.000Z"},"17":{"source":"themes/persona-dark/source/fancybox/fancybox_loading.gif","mtime":"2013-07-31T13:53:15.000Z"},"18":{"source":"themes/persona-dark/source/fancybox/fancybox_overlay.png","mtime":"2013-07-31T13:53:15.000Z"},"19":{"source":"themes/persona-dark/source/fancybox/fancybox_sprite.png","mtime":"2013-07-31T13:53:15.000Z"},"20":{"source":"themes/persona-dark/source/fancybox/jquery.fancybox.css","mtime":"2013-07-31T13:53:15.000Z"},"21":{"source":"themes/persona-dark/source/fancybox/jquery.fancybox.pack.js","mtime":"2013-07-31T13:53:15.000Z"},"22":{"source":"themes/persona-dark/source/js/gallery.js","mtime":"2013-07-31T13:53:15.000Z"},"23":{"source":"themes/persona-dark/source/js/jquery.imagesloaded.min.js","mtime":"2013-07-31T13:53:15.000Z"},"24":{"source":"themes/persona-dark/source/js/moment.min.js","mtime":"2013-07-31T13:53:15.000Z"},"25":{"source":"themes/persona-dark/source/js/twitter.js","mtime":"2013-07-31T13:53:15.000Z"},"26":{"source":"themes/persona-dark/source/css/style.styl","mtime":"2013-07-31T13:53:15.000Z"},"27":{"source":"themes/persona-dark/source/css/font/fontawesome-webfont.eot","mtime":"2013-07-31T13:53:15.000Z"},"28":{"source":"themes/persona-dark/source/css/font/fontawesome-webfont.svg","mtime":"2013-07-31T13:53:15.000Z"},"29":{"source":"themes/persona-dark/source/css/font/fontawesome-webfont.ttf","mtime":"2013-07-31T13:53:15.000Z"},"30":{"source":"themes/persona-dark/source/css/font/fontawesome-webfont.woff","mtime":"2013-07-31T13:53:15.000Z"},"_primary":31}}